app/controllers/saisons_controller.rb

  def index
    @saisons = Saison.all
---
SELECT "saisons".* FROM "saisons"

  def create
    @saison = Saison.new(saison_params)

    respond_to do |format|
      if @saison.save
---
INSERT INTO "saisons" ("annee", "created_at", "ligue", "sport", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["annee", "2016-2017"], ["created_at", Mon, 18 Jul 2016 18:33:23 UTC +00:00], ["ligue", "LHPS"], ["sport", "Hockey"], ["updated_at", Mon, 18 Jul 2016 18:33:23 UTC +00:00]]

    def set_saison
      @saison = Saison.find(params[:id])
---
SELECT "saisons".* FROM "saisons" WHERE "saisons"."id" = $1 LIMIT 1  [["id", "1"]]